Repository: kyxap1/oobash
Catalog: 0.39.3/locale/*/LC_MESSAGES/oobash.po
Languages: it

source: bash: $str: command not found.
it: bash: $str: comando non trovato.

source: Sorry, you should: source ${__FILENAME__} and not execute it...
it: Spiacente, dovresti fare: 'source ${__FILENAME__}', non eseguirlo...

source: Sorry, you need a bash version 4...
it: Spiacente, ti serve bash versione 4...

source: oo-style framework for bash 4
it: Libreria oo-style per bash 4

source: Version: ${__VERSION__}
it: Versione: ${__VERSION__}

source: Author: andreas.gregor.frank@googlemail.com
it: Autore: andreas.gregor.frank@googlemail.com

source: Stop showing this message by setting __QUIET__=true
it: Imposta __QUIET__=true per non visualizzare questo messaggio.

source: Try the developer tool: Class.generator
it: Prova lo strumento per sviluppatori: Class.generator

source: Classes: String, File, Boolean, System, Math
it: Classi: String, File, Boolean, System, Math

source: Constructors: String, File, Boolean
it: Costruttori: String, File, Boolean

source: Usage: String a teststring or File a testfile or Boolean a True
it: Utilizzo: String a teststring oppure File a testfile oppure Boolean a True

source: Usage: a.toString
it: Utilizzo: a.toString

source: Some String constants:
it: Qualche costante di String:

source: Some Math constants: -Math.E -Math.PI
it: Qualche costante di Math: -Math.E -Math.PI

source: Some Boolean constants: -Boolean.TRUE -Boolean.FALSE
it: Qualche costante Boolean: -Boolean.TRUE -Boolean.FALSE

source: Available help systems: String.help, File.help, Math.help, System.help, Boolean.help ...
it: Sistemi di aiuto disponibili: String.help, File.help, Math.help, System.help, Boolean.help ...

source: Usage: Classname.help methodname(s)|constructorname|constantname or keyword: all
it: Utilizzo: Classe.help metodo(i)|costruttore|costante o 'all'

source: Example: String.help zfill
it: Esempio: String.help zfill

source: Sorry, no valid classname: '$userClass'
it: Spiacente, nome di classe non valido: '$userClass'.

source: Sorry, no valid attribute name: '$attribute'
it: Spiacente, nome attributo non valido: '$attribute'.

source: Please enter one class name and the attributes
it: Inserire il nome della classe e gli attributi

source: Please enter one class name
it: Inserire il nome della classe

source: Example:
it: Esempio:

source: Class.generator Person name age city > Person.oobash
it: Class.generator Persona nome anni paese > Persona.oobash

source: Man.generator Person
it: Man.generator Persona

source: source Person.oobash
it: source Persona.oobash

source: Person a john 22 london
it: Persona a john 22 londra

source: a.getPersonAge
it: a.getPersonaAnni

source: >>>class Person
it: >>>class Persona

source: a.getPersonName
it: a.getPersonaNome

source: a.getPersonCity
it: a.getPersonaPaese

source: >>>london
it: >>>londra

source: If you develop something useful or funny, please
it: Se sviluppi qualcosa di utile o divertente, per favore

source: send it to me and i will publish it on sourceforge.
it: per favore mandamelo e lo pubblicherò su sourceforge.

source: Sorry, objectname '$this' is not valid
it: Spiacente, l'oggetto '$this' non è valido

source: Sorry, objectname '$this' is a keyword
it: Spiacente, il nome oggetto '$this' è una parola riservata

source: Sorry, no full stop character allowed in objectname
it: Spiacente, il carattere '.' punto non è permesso nel nome oggetto
