Repository: kyxap1/oobash
Catalog: 0.39.7/locale/*/LC_MESSAGES/oobash.po
Languages: de

source: bash: $str: command not found.
de: bash: $str: Kommando nicht gefunden.

source: Sorry, you should: source ${__FILENAME__} and not execute it...
de: Tut mir leid, Sie sollten: 'source ${__FILENAME__}' ausführen...

source: Sorry, you need a bash version 4...
de: Tut mir leid, Sie benoetigen eine bash mit Version 4...

source: oo-style framework for bash 4
de: oo-style Framework für bash 4

source: Author: andreas.gregor.frank@googlemail.com
de: Autor: andreas.gregor.frank@googlemail.com

source: Stop showing this message by setting __QUIET__=true
de: Diese Meldung kann durch __QUIET__=true deaktiviert werden

source: Try the developer tools: Class.generator Script.generator Man.generator
de: Versuchen Sie die Entwicklerwerkzeuge: Class.generator Script.generator Man.generator

source: Classes: String, File, Boolean, System, Math, I18nMessage, Process, Level, Ssh
de: Klassen: String, File, Boolean, System, Math, I18nMessage, Process, Level, Ssh

source: Constructors: String, File, Boolean, Process, Level, Ssh
de: Konstruktoren: String, File, Boolean, Process, Level, Ssh

source: Usage: String a teststring or File a testfile or Boolean a True
de: Anwendung: String a teststring oder File a testfile oder Boolean a True

source: Usage: a.toString
de: Anwendung: a.toString

source: Some String constants:
de: Einige String Konstanten:

source: Some Math constants: -Math.E -Math.PI
de: Einige Math Konstanten: -Math.E -Math.PI

source: Some Boolean constants: -Boolean.TRUE -Boolean.FALSE
de: Einige Boolean Konstanten: -Boolean.TRUE -Boolean.FALSE

source: Available help systems: String.help, File.help, Math.help, System.help, Boolean.help ...
de: Verfügbares Hilfe System: String.help, File.help, Math.help, System.help, Boolean.help ...

source: Usage: Classname.help methodname(s)|constructorname|constantname or keyword: all
de: Anwendung: Klassenname.help Methodenname(n)|Konstruktorname|Konstantenname oder Schlüsselwort all

source: Example: String.help zfill
de: Beispiel: String.help zfill

source: Sorry, no valid classname: '$userClass'
de: Tut mir leid, aber der Klassenname '$userClass' ist nicht gültig.

source: Sorry, no valid attribute name: '$attribute'
de: Tut mir leid, aber der Attributname '$attribute' ist nicht gültig.

source: Please enter one class name and the attributes
de: Bitte geben Sie einen Klassennamen und die Attribute ein.

source: Please enter one class name or scriptname
de: Bitte geben Sie einen Klassennamen oder einen Skriptnamen ein.

source: Example:
de: Beispiel:

source: or
de: oder

source: Class.generator Person name age city > Person.oobash
de: Class.generator Person name alter stadt > Person.oobash

source: a.getPersonAge
de: a.getPersonAlter

source: a.getPersonCity
de: a.getPersonStadt

source: If you develop something useful or funny, please
de: Wenn Sie etwas brauchbares oder lustiges entwickeln, bitte

source: send it to me and i will publish it on sourceforge.
de: senden Sie es mir zu und ich werde es auf sourceforge veroeffentlichen.

source: Sorry, objectname '$this' is not valid
de: Tut mir leid, aber der Objektname '$this' ist nicht gültig

source: Sorry, objectname '$this' is a keyword
de: Tut mir leid, aber der Objektname '$this' ist ein Schlüsselwort.

source: Sorry, no full stop character allowed in objectname
de: Tut mir leid, aber das Zeichen '.' ist in Objektnamen nicht erlaubt.

source: Sorry, could not create object '$this'
de: Tut mir leid, konnte das Object '$this' nicht erstellen

source: Doing dependency check...
de: Test auf Abhängigkeiten...

source: Everything ok!
de: Alles in Ordnung!

source: Please install the missing package(s) to have complete functionality
de: Bitte installieren Sie die fehlenden Pakete um volle Funktionalität zu haben.

source: Could not change MANPATH!
de: Konnte MANPATH nicht anpassen!

source: Please enter one script name
de: Bitte geben Sie einen Skriptnamen ein

source: Crash! Script already exists.
de: Abbruch ! Skript existiert bereits.

source: You can find the script skeleton here:
de: Sie können die Skriptvorlage hier finden:
